<!-- dflook/terraform-github-actions {"workspace":"judo-techniques-bot","backend_type":"remote","plan_modifier":"2ef1dfb46a19d7f27cd93ba12e0bc758c7c3625ce4c33ffcaa124e0b85d1303e","backend":"aab41a9aa61feb431db12cf565f8953fc05be4b8ead3f4ac611a0170d147786f","plan_job_ref":"Job Terraform Plan #13 at https://github.com/AbundantSalmon/judo-techniques-bot/actions/runs/6966560475","plan_hash":"423f3c2271b453c9ce81ed73328fff72545c08e5a72bbf900366c1b6c40a3fe0","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in __./terraform__ in the __judo-techniques-bot__ workspace
Replacing resources: `aws_ecs_service.jtb_service`
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.jtb_service must be replaced
-/+ resource "aws_ecs_service" "jtb_service" {
      - health_check_grace_period_seconds  = 0 -> null
      + iam_role                           = (known after apply)
      ~ id                                 = "*******************************************************************************************" -> (known after apply)
        name                               = "EcsClusterjtb_ecs-clusterService"
      + platform_version                   = (known after apply)
      - propagate_tags                     = "NONE" -> null
        tags                               = {
            "Module" = "ECS Cluster"
            "Name"   = "jtb_ecs-cluster"
        }
      ~ triggers                           = {} -> (known after apply)
        # (11 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #13](https://github.com/AbundantSalmon/judo-techniques-bot/actions/runs/6966560475)